app/Controllers/Auth/Auth.php

    public function attemptLogin()
{
    helper(['form']);

    $username = $this->request->getPost('username');
    $password = $this->request->getPost('password');

    if (!$username || !$password) {
        return redirect()->back()->withInput()->with('error', 'Username and password are required.');
    }

    $userModel = new UserModel();
    $user = $userModel->where('username', $username)->first();


    if (! $user) {
        $userId = $userModel->insert([
            'username' => $username,
            'password' => password_hash($password, PASSWORD_DEFAULT),
            'role'     => 'voter',
        ]);


        $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `username` = 'Beyonce'
 LIMIT 1
INSERT INTO `users` (`username`, `password`, `role`, `created_at`) VALUES ('Beyonce', '$2y$10$EweS3yMbBaJLBiigoWND6u02X4Mn.wGlW.w4buPMowd4rRc2NRKIW', 'voter', '2025-07-19 20:14:17')
SELECT *
FROM `users`
WHERE `users`.`id` = 6



    $db = \Config\Database::connect();
    $db->table('user_logins')->insert([
        'user_id' => $user['id']
    ]);
---
INSERT INTO `user_logins` (`user_id`) VALUES ('6')