app/Controllers/Vote.php

SELECT *
FROM `elections`
WHERE `status` = 'open'
---
    public function index()
    {
        $electionModel = new ElectionModel();
        $data['elections'] = $electionModel->where('status', 'open')->findAll();

INSERT INTO `votes` (`election_id`, `candidate_id`, `user_id`, `voted_at`, `updated_at`) VALUES ('1', '1', 1, '2025-07-17 19:02:21', '2025-07-17 19:02:21')
---
    public function cast($election_id)
    {
        $candidate_id = $this->request->getPost('candidate_id');

        if (! $candidate_id) {
            return redirect()->back()->with('error', 'No candidate selected.');
        }

        $voteModel = new VoteModel();

        $voteModel->save([
            'election_id' => $election_id,
            'candidate_id' => $candidate_id,
            'user_id' => session('user_id') // assumes user ID is stored in session after login
        ]);