app/Controllers/Vote.php

SELECT *
FROM `elections`
WHERE `elections`.`id` = 1
SELECT *
FROM `candidates`
WHERE `election_id` = 1
---
    public function candidates(int $election_id)
    {
        $election = $this->electionModel->find($election_id);
        if (!$election) {
            throw new PageNotFoundException('Election not found.');
        }

        $candidates = $this->candidateModel->where('election_id', $election_id)->findAll();

SELECT *
FROM `votes`
WHERE `election_id` = 1
AND `user_id` = 1
 LIMIT 1
UPDATE `votes` SET `candidate_id` = '1', `voted_at` = '2025-07-18 19:26:45'
WHERE `votes`.`id` IN ('1')
INSERT INTO `votes` (`election_id`, `candidate_id`, `user_id`, `voted_at`) VALUES (1, '1', '3', '2025-07-19 20:10:03')
---
    public function cast(int $election_id)
    {
        if (!$this->request->is('post')) {
            return redirect()->back()->with('error', 'Invalid request method.');
        }

        $candidate_id = $this->request->getPost('candidate_id');

        if (!$candidate_id) {
            return redirect()->back()->with('error', 'Candidate not selected.');
        }

        // Check if user already voted in this election
        $existingVote = $this->voteModel
            ->where('election_id', $election_id)
            ->where('user_id', session('user_id'))
            ->first();

        if ($existingVote) {
            // Update existing vote if changing candidate selection
            $this->voteModel->update($existingVote['id'], [
                'candidate_id' => $candidate_id,
                'voted_at' => date('Y-m-d H:i:s')
            ]);

            return redirect()->to("vote/result/{$election_id}")
                ->with('success', 'Your vote has been updated.');
        }

        // Insert new vote if first time voting
        $this->voteModel->insert([
            'election_id'  => $election_id,
            'candidate_id' => $candidate_id,
            'user_id'      => session('user_id'),
            'voted_at'     => date('Y-m-d H:i:s')
        ]);

SELECT *
FROM `candidates`
WHERE `election_id` = 1
SELECT COUNT(*) AS `numrows`
FROM `votes`
WHERE `election_id` = 1
AND `candidate_id` = '1'
---
    public function result(int $election_id)
    {
        $candidates = $this->candidateModel->where('election_id', $election_id)->findAll();

        foreach ($candidates as &$candidate) {
            $candidate['votes'] = $this->voteModel
                ->where('election_id', $election_id)
                ->where('candidate_id', $candidate['id'])
                ->countAllResults();